app/views/devise/registrations/_get_started_signup.html.erb

		<tr><td></td><td></td></tr>
		<tr id="registration" class="select_np_signup" style="display:none"><td><label>Select a Church</label></td><td><%= select_tag :non_profit, options_from_collection_for_select(NonProfit.all, "id", "name") %></td></tr>
---
SELECT `non_profits`.* FROM `non_profits`