app/views/home/find_my_block.html.erb

		<div class="selectnp">
			<label> Please select an organization and get started now: </label><%= select_tag :id, options_from_collection_for_select(NonProfit.all, "id", "name") %><input class="button" id="getstarted_gonp" name="commit" type="submit" value="Go">
---
SELECT `non_profits`.* FROM `non_profits`