app/views/home/get_started.html.erb

		<div class="selectnp">
			<label>Please select a church to support: </label><%= select_tag :id, options_from_collection_for_select(NonProfit.all(:order=> "name asc"), "id", "name") %><input class="button" id="getstarted_gonp" name="commit" type="submit" value="Go">
---
SELECT `non_profits`.* FROM `non_profits` ORDER BY name asc