app/controllers/home_controller.rb

SELECT `rooms`.* FROM `rooms`
SELECT `sponsors`.* FROM `sponsors` WHERE `sponsors`.`featured` = 1
---
  def index
    @rooms = Room.all
    @nonprofits = NonProfit.find(:all, :order => "name")
    @sponsors = Sponsor.where(:featured => true)

SELECT `non_profits`.* FROM `non_profits` ORDER BY name asc
---
  def get_started
    @nonprofits = NonProfit.all