app/controllers/non_profits_controller.rb

  def show
    @non_profit = NonProfit.find_by_id(params[:id])
    @non_profit_sp_list = @non_profit.sponsors.sort_by(&:name)

    @non_profit_sp =  @non_profit.sponsors.where(:featured => true)
    #snapshot = Snapshot.new

    #@non_profit.save_snapshot
    @rooms = @non_profit.rooms

    sum = Room.sum('width*height', :conditions => {:non_profit_id => params[:id]}).to_i

    if !@rooms.nil?
       if sum > 300
        @non_profit.expanded = true;
        @non_profit.update_attribute(:expanded, true)
      end
    end


    @reservations = Reservation.active.find(:all,  :conditions => "non_profit_id = #{@non_profit.id}")
---
SELECT `non_profits`.* FROM `non_profits` WHERE `non_profits`.`id` = 0 LIMIT 1
SELECT SUM(width*height) AS sum_id FROM `rooms` WHERE `rooms`.`non_profit_id` = 4
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`non_profit_id` = 4
SELECT `reservations`.* FROM `reservations` WHERE (created_at > '2013-09-04 22:32:34' ) AND (non_profit_id = 4)
SELECT `sponsors`.* FROM `sponsors` INNER JOIN `profit_sponsors` ON `sponsors`.`id` = `profit_sponsors`.`sponsor_id` WHERE `profit_sponsors`.`non_profit_id` = 4

  def search_by_name
    @non_profits = NonProfit.where("name like '%#{params[:keyword]}%' AND status = ?", "Verified")
---
SELECT `non_profits`.* FROM `non_profits` WHERE (name like '%Unity%')