app/controllers/payments_controller.rb

  def show
    @payment = Payment.find_by_identifier! params[:id]
---
SELECT `payments`.* FROM `payments` WHERE `payments`.`identifier` = 'new' LIMIT 1

  def create
    payment = Payment.create! params[:payment]
---
INSERT INTO `payments` (`amount`, `canceled`, `completed`, `created_at`, `digital`, `identifier`, `non_profit_id`, `popup`, `recurring`, `token`, `updated_at`) VALUES (2.0, NULL, NULL, '2013-09-05 12:30:11', NULL, NULL, NULL, NULL, 0, NULL, '2013-09-05 12:30:11')