app/controllers/reservations_controller.rb

  def new
    session[:gift_codes] = ''
    @room_options = RoomOption.all
    @non_profit = NonProfit.find(params[:non_profit_id])
    @x = params[:x]
    @y = params[:y]

    session[:x] = @x
    session[:y] = @y
    session[:non_profit_id] = @non_profit.id

    @has_gifts= false
    @redirect = add_entity_path

    if !params[:reserve_id].nil?
      @my_reserve = Reservation.find(params[:reserve_id])
      @create_new = false
      @has_gifts = @my_reserve.gift_codes.length > 0
    else params[:reserve_id].nil?
      @create_new = true
    end

    @isFundRaiser = false
    myString = "NP Fund"
    if !@non_profit.non_profit_type.nil? and @non_profit.non_profit_type.name.include?(myString)
---
SELECT `room_options`.* FROM `room_options`
SELECT `non_profits`.* FROM `non_profits` WHERE `non_profits`.`id` = 4 LIMIT 1
SELECT `non_profit_types`.* FROM `non_profit_types` WHERE `non_profit_types`.`id` = 2 LIMIT 1

  def validate_gift_code

    nonprofit_id = params[:non_profit_id]
    gift_code = params[:gift_code]

    code = validate_gift(gift_code, nonprofit_id)
    if !code.nil?
    code_is_empty = false

      redeemed = code.redeemed

       if !session[:cart_id].blank?
         cart = Cart.first(:conditions=>{:id=> session[:cart_id]})
         if !cart.nil?
            reserv_list = Reservation.where("cart_id=?", cart.id)
             reserv_list.each do |res|
                if res.gift_codes.upcase.to_s == code.code_value.to_s
                  redeemed -= code.redeem_value
                  if redeemed <= 0
                    code_is_empty = true;
                    break
                  end
                end
            end
         else
           session[:cart_id] = nil
         end
      end
    end

    non_profit = NonProfit.find(params[:non_profit_id])

    if !non_profit.non_profit_type.nil? and non_profit.non_profit_type.name.include?("NP Fund") and !code.nil?
---
SELECT `non_profits`.* FROM `non_profits` WHERE `non_profits`.`id` = 4 LIMIT 1
SELECT `non_profit_types`.* FROM `non_profit_types` WHERE `non_profit_types`.`id` = 2 LIMIT 1


       if !option_id.blank?
         option = RoomOption.find(option_id)
         option.blank?
---
SELECT `room_options`.* FROM `room_options`